ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp151axx_ca7.h
/****************  Bit definition for DDRCTRL_MRSTAT register  ****************/
#define DDRCTRL_MRSTAT_MR_WR_BUSY_Pos (0U)
#define DDRCTRL_MRSTAT_MR_WR_BUSY_Msk (0x1U << DDRCTRL_MRSTAT_MR_WR_BUSY_Pos) /*!< 0x00000001 */
#define DDRCTRL_MRSTAT_MR_WR_BUSY     DDRCTRL_MRSTAT_MR_WR_BUSY_Msk           /*!< The SoC core may initiate a MR write operation only if this signal is low. This signal goes high in the clock after the DDRCTRL accepts the MRW/MRR request. It goes low when the MRW/MRR command is issued to the SDRAM. It is recommended not to perform MRW/MRR commands when \qMRSTAT.mr_wr_busy\q is high. */

/***************  Bit definition for DDRCTRL_DERATEEN register  ***************/
#define DDRCTRL_DERATEEN_DERATE_ENABLE_Pos (0U)
#define DDRCTRL_DERATEEN_DERATE_ENABLE_Msk (0x1U << DDRCTRL_DERATEEN_DERATE_ENABLE_Pos) /*!< 0x00000001 */
#define DDRCTRL_DERATEEN_DERATE_ENABLE     DDRCTRL_DERATEEN_DERATE_ENABLE_Msk           /*!< Enables derating */
#define DDRCTRL_DERATEEN_DERATE_VALUE_Pos  (1U)
#define DDRCTRL_DERATEEN_DERATE_VALUE_Msk  (0x3U << DDRCTRL_DERATEEN_DERATE_VALUE_Pos)  /*!< 0x00000006 */
#define DDRCTRL_DERATEEN_DERATE_VALUE      DDRCTRL_DERATEEN_DERATE_VALUE_Msk            /*!< Derate value */
#define DDRCTRL_DERATEEN_DERATE_VALUE_0    (0x1U << DDRCTRL_DERATEEN_DERATE_VALUE_Pos)  /*!< 0x00000002 */
#define DDRCTRL_DERATEEN_DERATE_VALUE_1    (0x2U << DDRCTRL_DERATEEN_DERATE_VALUE_Pos)  /*!< 0x00000004 */
#define DDRCTRL_DERATEEN_DERATE_BYTE_Pos   (4U)
#define DDRCTRL_DERATEEN_DERATE_BYTE_Msk   (0xFU << DDRCTRL_DERATEEN_DERATE_BYTE_Pos)   /*!< 0x000000F0 */
#define DDRCTRL_DERATEEN_DERATE_BYTE       DDRCTRL_DERATEEN_DERATE_BYTE_Msk             /*!< Derate byte */
#define DDRCTRL_DERATEEN_DERATE_BYTE_0     (0x1U << DDRCTRL_DERATEEN_DERATE_BYTE_Pos)   /*!< 0x00000010 */
#define DDRCTRL_DERATEEN_DERATE_BYTE_1     (0x2U << DDRCTRL_DERATEEN_DERATE_BYTE_Pos)   /*!< 0x00000020 */
#define DDRCTRL_DERATEEN_DERATE_BYTE_2     (0x4U << DDRCTRL_DERATEEN_DERATE_BYTE_Pos)   /*!< 0x00000040 */
#define DDRCTRL_DERATEEN_DERATE_BYTE_3     (0x8U << DDRCTRL_DERATEEN_DERATE_BYTE_Pos)   /*!< 0x00000080 */

/**************  Bit definition for DDRCTRL_DERATEINT register  ***************/
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos (0U)
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Msk (0xFFFFFFFFU << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos) /*!< 0xFFFFFFFF */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL     DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Msk                  /*!< Interval between two MR4 reads, used to derate the timing parameters. */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_0   (0x1U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)        /*!< 0x00000001 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_1   (0x2U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)        /*!< 0x00000002 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_2   (0x4U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)        /*!< 0x00000004 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_3   (0x8U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)        /*!< 0x00000008 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_4   (0x10U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)       /*!< 0x00000010 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_5   (0x20U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)       /*!< 0x00000020 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_6   (0x40U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)       /*!< 0x00000040 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_7   (0x80U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)       /*!< 0x00000080 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_8   (0x100U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)      /*!< 0x00000100 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_9   (0x200U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)      /*!< 0x00000200 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_10  (0x400U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)      /*!< 0x00000400 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_11  (0x800U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)      /*!< 0x00000800 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_12  (0x1000U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)     /*!< 0x00001000 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_13  (0x2000U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)     /*!< 0x00002000 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_14  (0x4000U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)     /*!< 0x00004000 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_15  (0x8000U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)     /*!< 0x00008000 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_16  (0x10000U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)    /*!< 0x00010000 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_17  (0x20000U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)    /*!< 0x00020000 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_18  (0x40000U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)    /*!< 0x00040000 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_19  (0x80000U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)    /*!< 0x00080000 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_20  (0x100000U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)   /*!< 0x00100000 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_21  (0x200000U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)   /*!< 0x00200000 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_22  (0x400000U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)   /*!< 0x00400000 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_23  (0x800000U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)   /*!< 0x00800000 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_24  (0x1000000U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)  /*!< 0x01000000 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_25  (0x2000000U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)  /*!< 0x02000000 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_26  (0x4000000U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)  /*!< 0x04000000 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_27  (0x8000000U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos)  /*!< 0x08000000 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_28  (0x10000000U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos) /*!< 0x10000000 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_29  (0x20000000U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos) /*!< 0x20000000 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_30  (0x40000000U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos) /*!< 0x40000000 */
#define DDRCTRL_DERATEINT_MR4_READ_INTERVAL_31  (0x80000000U << DDRCTRL_DERATEINT_MR4_READ_INTERVAL_Pos) /*!< 0x80000000 */

/****************  Bit definition for DDRCTRL_PWRCTL register  ****************/
#define DDRCTRL_PWRCTL_SELFREF_EN_Pos              (0U)
#define DDRCTRL_PWRCTL_SELFREF_EN_Msk              (0x1U << DDRCTRL_PWRCTL_SELFREF_EN_Pos)              /*!< 0x00000001 */
#define DDRCTRL_PWRCTL_SELFREF_EN                  DDRCTRL_PWRCTL_SELFREF_EN_Msk                        /*!< If true then the DDRCTRL puts the SDRAM into Self Refresh after a programmable number of cycles "maximum idle clocks before Self Refresh (PWRTMG.selfref_to_x32)". This register bit may be re-programmed during the course of normal operation. */
#define DDRCTRL_PWRCTL_POWERDOWN_EN_Pos            (1U)
#define DDRCTRL_PWRCTL_POWERDOWN_EN_Msk            (0x1U << DDRCTRL_PWRCTL_POWERDOWN_EN_Pos)            /*!< 0x00000002 */
#define DDRCTRL_PWRCTL_POWERDOWN_EN                DDRCTRL_PWRCTL_POWERDOWN_EN_Msk                      /*!< If true then the DDRCTRL goes into power-down after a programmable number of cycles "maximum idle clocks before power down" (PWRTMG.powerdown_to_x32). */
#define DDRCTRL_PWRCTL_DEEPPOWERDOWN_EN_Pos        (2U)
#define DDRCTRL_PWRCTL_DEEPPOWERDOWN_EN_Msk        (0x1U << DDRCTRL_PWRCTL_DEEPPOWERDOWN_EN_Pos)        /*!< 0x00000004 */
#define DDRCTRL_PWRCTL_DEEPPOWERDOWN_EN            DDRCTRL_PWRCTL_DEEPPOWERDOWN_EN_Msk                  /*!< When this is 1, DDRCTRL puts the SDRAM into deep power-down mode when the transaction store is empty. */
#define DDRCTRL_PWRCTL_EN_DFI_DRAM_CLK_DISABLE_Pos (3U)
#define DDRCTRL_PWRCTL_EN_DFI_DRAM_CLK_DISABLE_Msk (0x1U << DDRCTRL_PWRCTL_EN_DFI_DRAM_CLK_DISABLE_Pos) /*!< 0x00000008 */
#define DDRCTRL_PWRCTL_EN_DFI_DRAM_CLK_DISABLE     DDRCTRL_PWRCTL_EN_DFI_DRAM_CLK_DISABLE_Msk           /*!< Enable the assertion of dfi_dram_clk_disable whenever a clock is not required by the SDRAM. */
#define DDRCTRL_PWRCTL_SELFREF_SW_Pos              (5U)
#define DDRCTRL_PWRCTL_SELFREF_SW_Msk              (0x1U << DDRCTRL_PWRCTL_SELFREF_SW_Pos)              /*!< 0x00000020 */
#define DDRCTRL_PWRCTL_SELFREF_SW                  DDRCTRL_PWRCTL_SELFREF_SW_Msk                        /*!< A value of 1 to this register causes system to move to Self Refresh state immediately, as long as it is not in INIT or DPD/MPSM operating_mode. This is referred to as Software Entry/Exit to Self Refresh. */
#define DDRCTRL_PWRCTL_DIS_CAM_DRAIN_SELFREF_Pos   (7U)
#define DDRCTRL_PWRCTL_DIS_CAM_DRAIN_SELFREF_Msk   (0x1U << DDRCTRL_PWRCTL_DIS_CAM_DRAIN_SELFREF_Pos)   /*!< 0x00000080 */
#define DDRCTRL_PWRCTL_DIS_CAM_DRAIN_SELFREF       DDRCTRL_PWRCTL_DIS_CAM_DRAIN_SELFREF_Msk             /*!< Indicates whether skipping CAM draining is allowed when entering Self-Refresh. */

/****************  Bit definition for DDRCTRL_PWRTMG register  ****************/
#define DDRCTRL_PWRTMG_POWERDOWN_TO_X32_Pos (0U)
#define DDRCTRL_PWRTMG_POWERDOWN_TO_X32_Msk (0x1FU << DDRCTRL_PWRTMG_POWERDOWN_TO_X32_Pos) /*!< 0x0000001F */
#define DDRCTRL_PWRTMG_POWERDOWN_TO_X32     DDRCTRL_PWRTMG_POWERDOWN_TO_X32_Msk            /*!< After this many clocks of the DDRC command channel being idle the DDRCTRL automatically puts the SDRAM into power-down. The DDRC command channel is considered idle when there are no HIF commands outstanding. This must be enabled in the PWRCTL.powerdown_en. */
#define DDRCTRL_PWRTMG_POWERDOWN_TO_X32_0   (0x1U << DDRCTRL_PWRTMG_POWERDOWN_TO_X32_Pos)  /*!< 0x00000001 */
#define DDRCTRL_PWRTMG_POWERDOWN_TO_X32_1   (0x2U << DDRCTRL_PWRTMG_POWERDOWN_TO_X32_Pos)  /*!< 0x00000002 */
#define DDRCTRL_PWRTMG_POWERDOWN_TO_X32_2   (0x4U << DDRCTRL_PWRTMG_POWERDOWN_TO_X32_Pos)  /*!< 0x00000004 */
#define DDRCTRL_PWRTMG_POWERDOWN_TO_X32_3   (0x8U << DDRCTRL_PWRTMG_POWERDOWN_TO_X32_Pos)  /*!< 0x00000008 */
#define DDRCTRL_PWRTMG_POWERDOWN_TO_X32_4   (0x10U << DDRCTRL_PWRTMG_POWERDOWN_TO_X32_Pos) /*!< 0x00000010 */
#define DDRCTRL_PWRTMG_T_DPD_X4096_Pos      (8U)
#define DDRCTRL_PWRTMG_T_DPD_X4096_Msk      (0xFFU << DDRCTRL_PWRTMG_T_DPD_X4096_Pos)      /*!< 0x0000FF00 */
#define DDRCTRL_PWRTMG_T_DPD_X4096          DDRCTRL_PWRTMG_T_DPD_X4096_Msk                 /*!< Minimum deep power-down time. */
#define DDRCTRL_PWRTMG_T_DPD_X4096_0        (0x1U << DDRCTRL_PWRTMG_T_DPD_X4096_Pos)       /*!< 0x00000100 */
#define DDRCTRL_PWRTMG_T_DPD_X4096_1        (0x2U << DDRCTRL_PWRTMG_T_DPD_X4096_Pos)       /*!< 0x00000200 */
#define DDRCTRL_PWRTMG_T_DPD_X4096_2        (0x4U << DDRCTRL_PWRTMG_T_DPD_X4096_Pos)       /*!< 0x00000400 */
#define DDRCTRL_PWRTMG_T_DPD_X4096_3        (0x8U << DDRCTRL_PWRTMG_T_DPD_X4096_Pos)       /*!< 0x00000800 */
#define DDRCTRL_PWRTMG_T_DPD_X4096_4        (0x10U << DDRCTRL_PWRTMG_T_DPD_X4096_Pos)      /*!< 0x00001000 */
#define DDRCTRL_PWRTMG_T_DPD_X4096_5        (0x20U << DDRCTRL_PWRTMG_T_DPD_X4096_Pos)      /*!< 0x00002000 */
#define DDRCTRL_PWRTMG_T_DPD_X4096_6        (0x40U << DDRCTRL_PWRTMG_T_DPD_X4096_Pos)      /*!< 0x00004000 */
#define DDRCTRL_PWRTMG_T_DPD_X4096_7        (0x80U << DDRCTRL_PWRTMG_T_DPD_X4096_Pos)      /*!< 0x00008000 */
#define DDRCTRL_PWRTMG_SELFREF_TO_X32_Pos   (16U)
#define DDRCTRL_PWRTMG_SELFREF_TO_X32_Msk   (0xFFU << DDRCTRL_PWRTMG_SELFREF_TO_X32_Pos)   /*!< 0x00FF0000 */
#define DDRCTRL_PWRTMG_SELFREF_TO_X32       DDRCTRL_PWRTMG_SELFREF_TO_X32_Msk              /*!< After this many clocks of the DDRC command channel being idle the DDRCTRL automatically puts the SDRAM into Self Refresh. The DDRC command channel is considered idle when there are no HIF commands outstanding. This must be enabled in the PWRCTL.selfref_en. */
#define DDRCTRL_PWRTMG_SELFREF_TO_X32_0     (0x1U << DDRCTRL_PWRTMG_SELFREF_TO_X32_Pos)    /*!< 0x00010000 */
#define DDRCTRL_PWRTMG_SELFREF_TO_X32_1     (0x2U << DDRCTRL_PWRTMG_SELFREF_TO_X32_Pos)    /*!< 0x00020000 */
#define DDRCTRL_PWRTMG_SELFREF_TO_X32_2     (0x4U << DDRCTRL_PWRTMG_SELFREF_TO_X32_Pos)    /*!< 0x00040000 */
#define DDRCTRL_PWRTMG_SELFREF_TO_X32_3     (0x8U << DDRCTRL_PWRTMG_SELFREF_TO_X32_Pos)    /*!< 0x00080000 */
#define DDRCTRL_PWRTMG_SELFREF_TO_X32_4     (0x10U << DDRCTRL_PWRTMG_SELFREF_TO_X32_Pos)   /*!< 0x00100000 */
#define DDRCTRL_PWRTMG_SELFREF_TO_X32_5     (0x20U << DDRCTRL_PWRTMG_SELFREF_TO_X32_Pos)   /*!< 0x00200000 */
#define DDRCTRL_PWRTMG_SELFREF_TO_X32_6     (0x40U << DDRCTRL_PWRTMG_SELFREF_TO_X32_Pos)   /*!< 0x00400000 */
#define DDRCTRL_PWRTMG_SELFREF_TO_X32_7     (0x80U << DDRCTRL_PWRTMG_SELFREF_TO_X32_Pos)   /*!< 0x00800000 */

/***************  Bit definition for DDRCTRL_HWLPCTL register  ****************/
#define DDRCTRL_HWLPCTL_HW_LP_EN_Pos           (0U)
#define DDRCTRL_HWLPCTL_HW_LP_EN_Msk           (0x1U << DDRCTRL_HWLPCTL_HW_LP_EN_Pos)           /*!< 0x00000001 */
#define DDRCTRL_HWLPCTL_HW_LP_EN               DDRCTRL_HWLPCTL_HW_LP_EN_Msk                     /*!< Enable for hardware low power interface. */
#define DDRCTRL_HWLPCTL_HW_LP_EXIT_IDLE_EN_Pos (1U)
#define DDRCTRL_HWLPCTL_HW_LP_EXIT_IDLE_EN_Msk (0x1U << DDRCTRL_HWLPCTL_HW_LP_EXIT_IDLE_EN_Pos) /*!< 0x00000002 */
#define DDRCTRL_HWLPCTL_HW_LP_EXIT_IDLE_EN     DDRCTRL_HWLPCTL_HW_LP_EXIT_IDLE_EN_Msk           /*!< When this bit is programmed to 1 the cactive_in_ddrc pin of the DDRC can be used to exit from the automatic clock stop, automatic power down or automatic self-refresh modes. Note, it does not cause exit of Self-Refresh that is caused by Hardware Low power interface and/or software (PWRCTL.selfref_sw). */
#define DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_Pos     (16U)
#define DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_Msk     (0xFFFU << DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_Pos)   /*!< 0x0FFF0000 */
#define DDRCTRL_HWLPCTL_HW_LP_IDLE_X32         DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_Msk               /*!< Hardware idle period. The cactive_ddrc output is driven low if the DDRC command channel is idle for hw_lp_idle * 32 cycles if not in INIT or DPD/MPSM operating_mode. The DDRC command channel is considered idle when there are no HIF commands outstanding. The hardware idle function is disabled when hw_lp_idle_x32=0. */
#define DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_0       (0x1U << DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_Pos)     /*!< 0x00010000 */
#define DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_1       (0x2U << DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_Pos)     /*!< 0x00020000 */
#define DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_2       (0x4U << DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_Pos)     /*!< 0x00040000 */
#define DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_3       (0x8U << DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_Pos)     /*!< 0x00080000 */
#define DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_4       (0x10U << DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_Pos)    /*!< 0x00100000 */
#define DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_5       (0x20U << DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_Pos)    /*!< 0x00200000 */
#define DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_6       (0x40U << DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_Pos)    /*!< 0x00400000 */
#define DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_7       (0x80U << DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_Pos)    /*!< 0x00800000 */
#define DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_8       (0x100U << DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_Pos)   /*!< 0x01000000 */
#define DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_9       (0x200U << DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_Pos)   /*!< 0x02000000 */
#define DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_10      (0x400U << DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_Pos)   /*!< 0x04000000 */
#define DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_11      (0x800U << DDRCTRL_HWLPCTL_HW_LP_IDLE_X32_Pos)   /*!< 0x08000000 */

/***************  Bit definition for DDRCTRL_RFSHCTL0 register  ***************/
#define DDRCTRL_RFSHCTL0_PER_BANK_REFRESH_Pos (2U)
#define DDRCTRL_RFSHCTL0_PER_BANK_REFRESH_Msk (0x1U << DDRCTRL_RFSHCTL0_PER_BANK_REFRESH_Pos) /*!< 0x00000004 */
#define DDRCTRL_RFSHCTL0_PER_BANK_REFRESH     DDRCTRL_RFSHCTL0_PER_BANK_REFRESH_Msk           /*!< - 1 - Per bank refresh; */
#define DDRCTRL_RFSHCTL0_REFRESH_BURST_Pos    (4U)
#define DDRCTRL_RFSHCTL0_REFRESH_BURST_Msk    (0x1FU << DDRCTRL_RFSHCTL0_REFRESH_BURST_Pos)   /*!< 0x000001F0 */
#define DDRCTRL_RFSHCTL0_REFRESH_BURST        DDRCTRL_RFSHCTL0_REFRESH_BURST_Msk              /*!< The programmed value + 1 is the number of refresh timeouts that is allowed to accumulate before traffic is blocked and the refreshes are forced to execute. Closing pages to perform a refresh is a one-time penalty that must be paid for each group of refreshes. Therefore, performing refreshes in a burst reduces the per-refresh penalty of these page closings. Higher numbers for RFSHCTL.refresh_burst slightly increases utilization; lower numbers decreases the worst-case latency associated with refreshes. */
#define DDRCTRL_RFSHCTL0_REFRESH_BURST_0      (0x1U << DDRCTRL_RFSHCTL0_REFRESH_BURST_Pos)    /*!< 0x00000010 */
#define DDRCTRL_RFSHCTL0_REFRESH_BURST_1      (0x2U << DDRCTRL_RFSHCTL0_REFRESH_BURST_Pos)    /*!< 0x00000020 */
#define DDRCTRL_RFSHCTL0_REFRESH_BURST_2      (0x4U << DDRCTRL_RFSHCTL0_REFRESH_BURST_Pos)    /*!< 0x00000040 */
#define DDRCTRL_RFSHCTL0_REFRESH_BURST_3      (0x8U << DDRCTRL_RFSHCTL0_REFRESH_BURST_Pos)    /*!< 0x00000080 */
#define DDRCTRL_RFSHCTL0_REFRESH_BURST_4      (0x10U << DDRCTRL_RFSHCTL0_REFRESH_BURST_Pos)   /*!< 0x00000100 */
#define DDRCTRL_RFSHCTL0_REFRESH_TO_X32_Pos   (12U)
#define DDRCTRL_RFSHCTL0_REFRESH_TO_X32_Msk   (0x1FU << DDRCTRL_RFSHCTL0_REFRESH_TO_X32_Pos)  /*!< 0x0001F000 */
#define DDRCTRL_RFSHCTL0_REFRESH_TO_X32       DDRCTRL_RFSHCTL0_REFRESH_TO_X32_Msk             /*!< If the refresh timer (tRFCnom, also known as tREFI) has expired at least once, but it has not expired (RFSHCTL0.refresh_burst+1) times yet, then a speculative refresh may be performed. A speculative refresh is a refresh performed at a time when refresh would be useful, but before it is absolutely required. When the SDRAM bus is idle for a period of time determined by this RFSHCTL0.refresh_to_x32 and the refresh timer has expired at least once since the last refresh, then a speculative refresh is performed. Speculative refreshes continues successively until there are no refreshes pending or until new reads or writes are issued to the DDRCTRL. */
#define DDRCTRL_RFSHCTL0_REFRESH_TO_X32_0     (0x1U << DDRCTRL_RFSHCTL0_REFRESH_TO_X32_Pos)   /*!< 0x00001000 */
#define DDRCTRL_RFSHCTL0_REFRESH_TO_X32_1     (0x2U << DDRCTRL_RFSHCTL0_REFRESH_TO_X32_Pos)   /*!< 0x00002000 */
#define DDRCTRL_RFSHCTL0_REFRESH_TO_X32_2     (0x4U << DDRCTRL_RFSHCTL0_REFRESH_TO_X32_Pos)   /*!< 0x00004000 */
#define DDRCTRL_RFSHCTL0_REFRESH_TO_X32_3     (0x8U << DDRCTRL_RFSHCTL0_REFRESH_TO_X32_Pos)   /*!< 0x00008000 */
#define DDRCTRL_RFSHCTL0_REFRESH_TO_X32_4     (0x10U << DDRCTRL_RFSHCTL0_REFRESH_TO_X32_Pos)  /*!< 0x00010000 */
#define DDRCTRL_RFSHCTL0_REFRESH_MARGIN_Pos   (20U)
#define DDRCTRL_RFSHCTL0_REFRESH_MARGIN_Msk   (0xFU << DDRCTRL_RFSHCTL0_REFRESH_MARGIN_Pos)   /*!< 0x00F00000 */
#define DDRCTRL_RFSHCTL0_REFRESH_MARGIN       DDRCTRL_RFSHCTL0_REFRESH_MARGIN_Msk             /*!< Threshold value in number of DFI clock cycles before the critical refresh or page timer expires. A critical refresh is to be issued before this threshold is reached. It is recommended that this not be changed from the default value, currently shown as 0x2. It must always be less than internally used t_rfc_nom/32. Note that internally used t_rfc_nom is equal to RFSHTMG.t_rfc_nom_x1_x32 * 32 if RFSHTMG.t_rfc_nom_x1_sel=0. If RFSHTMG.t_rfc_nom_x1_sel=1 (for LPDDR2/LPDDR3/LPDDR4 per-bank refresh only), internally used t_rfc_nom is equal to RFSHTMG.t_rfc_nom_x1_x32. Note that, in LPDDR2/LPDDR3/LPDDR4, internally used t_rfc_nom may be divided by four if derating is enabled (DERATEEN.derate_enable=1). */
#define DDRCTRL_RFSHCTL0_REFRESH_MARGIN_0     (0x1U << DDRCTRL_RFSHCTL0_REFRESH_MARGIN_Pos)   /*!< 0x00100000 */
#define DDRCTRL_RFSHCTL0_REFRESH_MARGIN_1     (0x2U << DDRCTRL_RFSHCTL0_REFRESH_MARGIN_Pos)   /*!< 0x00200000 */
#define DDRCTRL_RFSHCTL0_REFRESH_MARGIN_2     (0x4U << DDRCTRL_RFSHCTL0_REFRESH_MARGIN_Pos)   /*!< 0x00400000 */
#define DDRCTRL_RFSHCTL0_REFRESH_MARGIN_3     (0x8U << DDRCTRL_RFSHCTL0_REFRESH_MARGIN_Pos)   /*!< 0x00800000 */

/***************  Bit definition for DDRCTRL_RFSHCTL3 register  ***************/
#define DDRCTRL_RFSHCTL3_DIS_AUTO_REFRESH_Pos     (0U)
#define DDRCTRL_RFSHCTL3_DIS_AUTO_REFRESH_Msk     (0x1U << DDRCTRL_RFSHCTL3_DIS_AUTO_REFRESH_Pos)     /*!< 0x00000001 */
#define DDRCTRL_RFSHCTL3_DIS_AUTO_REFRESH         DDRCTRL_RFSHCTL3_DIS_AUTO_REFRESH_Msk               /*!< When \q1\q, disable auto-refresh generated by the DDRCTRL. When auto-refresh is disabled, the SoC core must generate refreshes using the registers DBGCMD.rankn_refresh. */
#define DDRCTRL_RFSHCTL3_REFRESH_UPDATE_LEVEL_Pos (1U)
#define DDRCTRL_RFSHCTL3_REFRESH_UPDATE_LEVEL_Msk (0x1U << DDRCTRL_RFSHCTL3_REFRESH_UPDATE_LEVEL_Pos) /*!< 0x00000002 */
#define DDRCTRL_RFSHCTL3_REFRESH_UPDATE_LEVEL     DDRCTRL_RFSHCTL3_REFRESH_UPDATE_LEVEL_Msk           /*!< Toggles this signal (either from 0 to 1 or from 1 to 0) to indicate that the refresh register(s) have been updated. */

