ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp151axx_ca7.h
/****************  Bit definition for RCC_PLL3CFGR1 register  *****************/
#define RCC_PLL3CFGR1_DIVN_Pos                    (0U)
#define RCC_PLL3CFGR1_DIVN_Msk                    (0x1FFU << RCC_PLL3CFGR1_DIVN_Pos)                 /*!< 0x000001FF */
#define RCC_PLL3CFGR1_DIVN                        RCC_PLL3CFGR1_DIVN_Msk                             /*!< Multiplication factor for PLL3 VCO */
#define RCC_PLL3CFGR1_DIVN_0                      (0x1U << RCC_PLL3CFGR1_DIVN_Pos)                   /*!< 0x00000001 */
#define RCC_PLL3CFGR1_DIVN_1                      (0x2U << RCC_PLL3CFGR1_DIVN_Pos)                   /*!< 0x00000002 */
#define RCC_PLL3CFGR1_DIVN_2                      (0x4U << RCC_PLL3CFGR1_DIVN_Pos)                   /*!< 0x00000004 */
#define RCC_PLL3CFGR1_DIVN_3                      (0x8U << RCC_PLL3CFGR1_DIVN_Pos)                   /*!< 0x00000008 */
#define RCC_PLL3CFGR1_DIVN_4                      (0x10U << RCC_PLL3CFGR1_DIVN_Pos)                  /*!< 0x00000010 */
#define RCC_PLL3CFGR1_DIVN_5                      (0x20U << RCC_PLL3CFGR1_DIVN_Pos)                  /*!< 0x00000020 */
#define RCC_PLL3CFGR1_DIVN_6                      (0x40U << RCC_PLL3CFGR1_DIVN_Pos)                  /*!< 0x00000040 */
#define RCC_PLL3CFGR1_DIVN_7                      (0x80U << RCC_PLL3CFGR1_DIVN_Pos)                  /*!< 0x00000080 */
#define RCC_PLL3CFGR1_DIVN_8                      (0x100U << RCC_PLL3CFGR1_DIVN_Pos)                 /*!< 0x00000100 */
#define RCC_PLL3CFGR1_DIVM3_Pos                   (16U)
#define RCC_PLL3CFGR1_DIVM3_Msk                   (0x3FU << RCC_PLL3CFGR1_DIVM3_Pos)                 /*!< 0x003F0000 */
#define RCC_PLL3CFGR1_DIVM3                       RCC_PLL3CFGR1_DIVM3_Msk                            /*!< Prescaler for PLL3 */
#define RCC_PLL3CFGR1_DIVM3_0                     (0x1U << RCC_PLL3CFGR1_DIVM3_Pos)              /*!< 0x00010000 */
#define RCC_PLL3CFGR1_DIVM3_1                     (0x2U << RCC_PLL3CFGR1_DIVM3_Pos)              /*!< 0x00020000 */
#define RCC_PLL3CFGR1_DIVM3_2                     (0x4U << RCC_PLL3CFGR1_DIVM3_Pos)              /*!< 0x00040000 */
#define RCC_PLL3CFGR1_DIVM3_3                     (0x8U << RCC_PLL3CFGR1_DIVM3_Pos)              /*!< 0x00080000 */
#define RCC_PLL3CFGR1_DIVM3_4                     (0x10U << RCC_PLL3CFGR1_DIVM3_Pos)             /*!< 0x00100000 */
#define RCC_PLL3CFGR1_DIVM3_5                     (0x20U << RCC_PLL3CFGR1_DIVM3_Pos)             /*!< 0x00200000 */
#define RCC_PLL3CFGR1_IFRGE_Pos                   (24U)
#define RCC_PLL3CFGR1_IFRGE_Msk                   (0x3U << RCC_PLL3CFGR1_IFRGE_Pos)                  /*!< 0x03000000 */
#define RCC_PLL3CFGR1_IFRGE                       RCC_PLL3CFGR1_IFRGE_Msk                            /*!< PLL3 input frequency range */
#define RCC_PLL3CFGR1_IFRGE_0                     (0x1U << RCC_PLL3CFGR1_IFRGE_Pos)            /*!< 0x01000000 */
#define RCC_PLL3CFGR1_IFRGE_1                     (0x2U << RCC_PLL3CFGR1_IFRGE_Pos)            /*!< 0x02000000 */

/****************  Bit definition for RCC_PLL3CFGR2 register  *****************/
#define RCC_PLL3CFGR2_DIVP_Pos                    (0U)
#define RCC_PLL3CFGR2_DIVP_Msk                    (0x7FU << RCC_PLL3CFGR2_DIVP_Pos)                  /*!< 0x0000007F */
#define RCC_PLL3CFGR2_DIVP                        RCC_PLL3CFGR2_DIVP_Msk                             /*!< PLL3 DIVP division factor */
#define RCC_PLL3CFGR2_DIVP_0                      (0x1U << RCC_PLL3CFGR2_DIVP_Pos)                   /*!< 0x00000001 */
#define RCC_PLL3CFGR2_DIVP_1                      (0x2U << RCC_PLL3CFGR2_DIVP_Pos)                   /*!< 0x00000002 */
#define RCC_PLL3CFGR2_DIVP_2                      (0x4U << RCC_PLL3CFGR2_DIVP_Pos)                   /*!< 0x00000004 */
#define RCC_PLL3CFGR2_DIVP_3                      (0x8U << RCC_PLL3CFGR2_DIVP_Pos)                   /*!< 0x00000008 */
#define RCC_PLL3CFGR2_DIVP_4                      (0x10U << RCC_PLL3CFGR2_DIVP_Pos)                  /*!< 0x00000010 */
#define RCC_PLL3CFGR2_DIVP_5                      (0x20U << RCC_PLL3CFGR2_DIVP_Pos)                  /*!< 0x00000020 */
#define RCC_PLL3CFGR2_DIVP_6                      (0x40U << RCC_PLL3CFGR2_DIVP_Pos)                  /*!< 0x00000040 */
#define RCC_PLL3CFGR2_DIVQ_Pos                    (8U)
#define RCC_PLL3CFGR2_DIVQ_Msk                    (0x7FU << RCC_PLL3CFGR2_DIVQ_Pos)                  /*!< 0x00007F00 */
#define RCC_PLL3CFGR2_DIVQ                        RCC_PLL3CFGR2_DIVQ_Msk                             /*!< PLL3 DIVQ division factor */
#define RCC_PLL3CFGR2_DIVQ_0                      (0x1U << RCC_PLL3CFGR2_DIVQ_Pos)                 /*!< 0x00000100 */
#define RCC_PLL3CFGR2_DIVQ_1                      (0x2U << RCC_PLL3CFGR2_DIVQ_Pos)                 /*!< 0x00000200 */
#define RCC_PLL3CFGR2_DIVQ_2                      (0x4U << RCC_PLL3CFGR2_DIVQ_Pos)                 /*!< 0x00000400 */
#define RCC_PLL3CFGR2_DIVQ_3                      (0x8U << RCC_PLL3CFGR2_DIVQ_Pos)                 /*!< 0x00000800 */
#define RCC_PLL3CFGR2_DIVQ_4                      (0x10U << RCC_PLL3CFGR2_DIVQ_Pos)                /*!< 0x00001000 */
#define RCC_PLL3CFGR2_DIVQ_5                      (0x20U << RCC_PLL3CFGR2_DIVQ_Pos)                /*!< 0x00002000 */
#define RCC_PLL3CFGR2_DIVQ_6                      (0x40U << RCC_PLL3CFGR2_DIVQ_Pos)                /*!< 0x00004000 */
#define RCC_PLL3CFGR2_DIVR_Pos                    (16U)
#define RCC_PLL3CFGR2_DIVR_Msk                    (0x7FU << RCC_PLL3CFGR2_DIVR_Pos)                  /*!< 0x007F0000 */
#define RCC_PLL3CFGR2_DIVR                        RCC_PLL3CFGR2_DIVR_Msk                             /*!< PLL3 DIVR division factor */
#define RCC_PLL3CFGR2_DIVR_0                      (0x1U << RCC_PLL3CFGR2_DIVR_Pos)               /*!< 0x00010000 */
#define RCC_PLL3CFGR2_DIVR_1                      (0x2U << RCC_PLL3CFGR2_DIVR_Pos)               /*!< 0x00020000 */
#define RCC_PLL3CFGR2_DIVR_2                      (0x4U << RCC_PLL3CFGR2_DIVR_Pos)               /*!< 0x00040000 */
#define RCC_PLL3CFGR2_DIVR_3                      (0x8U << RCC_PLL3CFGR2_DIVR_Pos)               /*!< 0x00080000 */
#define RCC_PLL3CFGR2_DIVR_4                      (0x10U << RCC_PLL3CFGR2_DIVR_Pos)              /*!< 0x00100000 */
#define RCC_PLL3CFGR2_DIVR_5                      (0x20U << RCC_PLL3CFGR2_DIVR_Pos)              /*!< 0x00200000 */
#define RCC_PLL3CFGR2_DIVR_6                      (0x40U << RCC_PLL3CFGR2_DIVR_Pos)              /*!< 0x00400000 */

/****************  Bit definition for RCC_PLL3FRACR register  *****************/
#define RCC_PLL3FRACR_FRACV_Pos                   (3U)
#define RCC_PLL3FRACR_FRACV_Msk                   (0x1FFFU << RCC_PLL3FRACR_FRACV_Pos)               /*!< 0x0000FFF8 */
#define RCC_PLL3FRACR_FRACV                       RCC_PLL3FRACR_FRACV_Msk                            /*!< Fractional part of the multiplication factor for PLL3 VCO */
#define RCC_PLL3FRACR_FRACV_0                     (0x1U << RCC_PLL3FRACR_FRACV_Pos)                  /*!< 0x00000008 */
#define RCC_PLL3FRACR_FRACV_1                     (0x2U << RCC_PLL3FRACR_FRACV_Pos)                 /*!< 0x00000010 */
#define RCC_PLL3FRACR_FRACV_2                     (0x4U << RCC_PLL3FRACR_FRACV_Pos)                 /*!< 0x00000020 */
#define RCC_PLL3FRACR_FRACV_3                     (0x8U << RCC_PLL3FRACR_FRACV_Pos)                 /*!< 0x00000040 */
#define RCC_PLL3FRACR_FRACV_4                     (0x10U << RCC_PLL3FRACR_FRACV_Pos)                 /*!< 0x00000080 */
#define RCC_PLL3FRACR_FRACV_5                     (0x20U << RCC_PLL3FRACR_FRACV_Pos)                /*!< 0x00000100 */
#define RCC_PLL3FRACR_FRACV_6                     (0x40U << RCC_PLL3FRACR_FRACV_Pos)                /*!< 0x00000200 */
#define RCC_PLL3FRACR_FRACV_7                     (0x80U << RCC_PLL3FRACR_FRACV_Pos)                /*!< 0x00000400 */
#define RCC_PLL3FRACR_FRACV_8                     (0x100U << RCC_PLL3FRACR_FRACV_Pos)                /*!< 0x00000800 */
#define RCC_PLL3FRACR_FRACV_9                     (0x200U << RCC_PLL3FRACR_FRACV_Pos)               /*!< 0x00001000 */
#define RCC_PLL3FRACR_FRACV_10                    (0x400U << RCC_PLL3FRACR_FRACV_Pos)               /*!< 0x00002000 */
#define RCC_PLL3FRACR_FRACV_11                    (0x800U << RCC_PLL3FRACR_FRACV_Pos)               /*!< 0x00004000 */
#define RCC_PLL3FRACR_FRACV_12                    (0x1000U << RCC_PLL3FRACR_FRACV_Pos)               /*!< 0x00008000 */
#define RCC_PLL3FRACR_FRACLE_Pos                  (16U)
#define RCC_PLL3FRACR_FRACLE_Msk                  (0x1U << RCC_PLL3FRACR_FRACLE_Pos)                 /*!< 0x00010000 */
#define RCC_PLL3FRACR_FRACLE                      RCC_PLL3FRACR_FRACLE_Msk                           /*!< PLL3 fractional latch enable */

/********************  Bit definition for RCC_PLL3CSGR register********************/
#define RCC_PLL3CSGR_MOD_PER_Pos              (0U)
#define RCC_PLL3CSGR_MOD_PER_Msk              (0x1FFFU << RCC_PLL3CSGR_MOD_PER_Pos) /*!< 0x00001FFF */
#define RCC_PLL3CSGR_MOD_PER                  RCC_PLL3CSGR_MOD_PER_Msk         /*Modulation Period Adjustment for PLL3*/
#define RCC_PLL3CSGR_TPDFN_DIS_Pos            (13U)
#define RCC_PLL3CSGR_TPDFN_DIS_Msk            (0x1U << RCC_PLL3CSGR_TPDFN_DIS_Pos) /*!< 0x00002000 */
#define RCC_PLL3CSGR_TPDFN_DIS                RCC_PLL3CSGR_TPDFN_DIS_Msk       /*Dithering TPDF noise control*/
#define RCC_PLL3CSGR_RPDFN_DIS_Pos            (14U)
#define RCC_PLL3CSGR_RPDFN_DIS_Msk            (0x1U << RCC_PLL3CSGR_RPDFN_DIS_Pos) /*!< 0x00004000 */
#define RCC_PLL3CSGR_RPDFN_DIS                RCC_PLL3CSGR_RPDFN_DIS_Msk       /*Dithering RPDF noise control*/
#define RCC_PLL3CSGR_SSCG_MODE_Pos            (15U)
#define RCC_PLL3CSGR_SSCG_MODE_Msk            (0x1U << RCC_PLL3CSGR_SSCG_MODE_Pos) /*!< 0x00008000 */
#define RCC_PLL3CSGR_SSCG_MODE                RCC_PLL3CSGR_SSCG_MODE_Msk       /*Spread spectrum clock generator mode*/
#define RCC_PLL3CSGR_INC_STEP_Pos             (16U)
#define RCC_PLL3CSGR_INC_STEP_Msk             (0x7FFFU << RCC_PLL3CSGR_INC_STEP_Pos) /*!< 0x7FFF0000 */
#define RCC_PLL3CSGR_INC_STEP_Pos             (16U)
#define RCC_PLL3CSGR_INC_STEP_Msk             (0x7FFFU << RCC_PLL3CSGR_INC_STEP_Pos) /*!< 0x7FFF0000 */
#define RCC_PLL3CSGR_INC_STEP                 RCC_PLL3CSGR_INC_STEP_Msk        /*Modulation Depth Adjustment for PLL3*/

/******************  Bit definition for RCC_PLL4CR register  ******************/
#define RCC_PLL4CR_PLLON_Pos                      (0U)
#define RCC_PLL4CR_PLLON_Msk                      (0x1U << RCC_PLL4CR_PLLON_Pos)                     /*!< 0x00000001 */
#define RCC_PLL4CR_PLLON                          RCC_PLL4CR_PLLON_Msk                               /*!< PLL4 enable */
#define RCC_PLL4CR_PLL4RDY_Pos                    (1U)
#define RCC_PLL4CR_PLL4RDY_Msk                    (0x1U << RCC_PLL4CR_PLL4RDY_Pos)                   /*!< 0x00000002 */
#define RCC_PLL4CR_PLL4RDY                        RCC_PLL4CR_PLL4RDY_Msk                             /*!< PLL4 clock ready flag */
#define RCC_PLL4CR_SSCG_CTRL_Pos                  (2U)
#define RCC_PLL4CR_SSCG_CTRL_Msk                  (0x1U << RCC_PLL4CR_SSCG_CTRL_Pos)                 /*!< 0x00000004 */
#define RCC_PLL4CR_SSCG_CTRL                      RCC_PLL4CR_SSCG_CTRL_Msk                           /*Spread Spectrum Clock Generator of PLL4 enable*/
#define RCC_PLL4CR_DIVPEN_Pos                     (4U)
#define RCC_PLL4CR_DIVPEN_Msk                     (0x1U << RCC_PLL4CR_DIVPEN_Pos)                    /*!< 0x00000010 */
#define RCC_PLL4CR_DIVPEN                         RCC_PLL4CR_DIVPEN_Msk                              /*!< PLL4 DIVP divider output enable */
#define RCC_PLL4CR_DIVQEN_Pos                     (5U)
#define RCC_PLL4CR_DIVQEN_Msk                     (0x1U << RCC_PLL4CR_DIVQEN_Pos)                    /*!< 0x00000020 */
#define RCC_PLL4CR_DIVQEN                         RCC_PLL4CR_DIVQEN_Msk                              /*!< PLL4 DIVQ divider output enable */
#define RCC_PLL4CR_DIVREN_Pos                     (6U)
#define RCC_PLL4CR_DIVREN_Msk                     (0x1U << RCC_PLL4CR_DIVREN_Pos)                    /*!< 0x00000040 */
#define RCC_PLL4CR_DIVREN                         RCC_PLL4CR_DIVREN_Msk                              /*!< PLL4 DIVR divider output enable */

/****************  Bit definition for RCC_PLL4CFGR1 register  *****************/
#define RCC_PLL4CFGR1_DIVN_Pos                    (0U)
#define RCC_PLL4CFGR1_DIVN_Msk                    (0x1FFU << RCC_PLL4CFGR1_DIVN_Pos)                 /*!< 0x000001FF */
#define RCC_PLL4CFGR1_DIVN                        RCC_PLL4CFGR1_DIVN_Msk                             /*!< Multiplication factor for PLL4 VCO */
#define RCC_PLL4CFGR1_DIVN_0                      (0x1U << RCC_PLL4CFGR1_DIVN_Pos)                   /*!< 0x00000001 */
#define RCC_PLL4CFGR1_DIVN_1                      (0x2U << RCC_PLL4CFGR1_DIVN_Pos)                   /*!< 0x00000002 */
#define RCC_PLL4CFGR1_DIVN_2                      (0x4U << RCC_PLL4CFGR1_DIVN_Pos)                   /*!< 0x00000004 */
#define RCC_PLL4CFGR1_DIVN_3                      (0x8U << RCC_PLL4CFGR1_DIVN_Pos)                   /*!< 0x00000008 */
#define RCC_PLL4CFGR1_DIVN_4                      (0x10U << RCC_PLL4CFGR1_DIVN_Pos)                  /*!< 0x00000010 */
#define RCC_PLL4CFGR1_DIVN_5                      (0x20U << RCC_PLL4CFGR1_DIVN_Pos)                  /*!< 0x00000020 */
#define RCC_PLL4CFGR1_DIVN_6                      (0x40U << RCC_PLL4CFGR1_DIVN_Pos)                  /*!< 0x00000040 */
#define RCC_PLL4CFGR1_DIVN_7                      (0x80U << RCC_PLL4CFGR1_DIVN_Pos)                  /*!< 0x00000080 */
#define RCC_PLL4CFGR1_DIVN_8                      (0x100U << RCC_PLL4CFGR1_DIVN_Pos)                 /*!< 0x00000100 */
#define RCC_PLL4CFGR1_DIVM4_Pos                   (16U)
#define RCC_PLL4CFGR1_DIVM4_Msk                   (0x3FU << RCC_PLL4CFGR1_DIVM4_Pos)                 /*!< 0x003F0000 */
#define RCC_PLL4CFGR1_DIVM4                       RCC_PLL4CFGR1_DIVM4_Msk                            /*!< Prescaler for PLL4 */
#define RCC_PLL4CFGR1_DIVM4_0                     (0x1U << RCC_PLL4CFGR1_DIVM4_Pos)              /*!< 0x00010000 */
#define RCC_PLL4CFGR1_DIVM4_1                     (0x2U << RCC_PLL4CFGR1_DIVM4_Pos)              /*!< 0x00020000 */
#define RCC_PLL4CFGR1_DIVM4_2                     (0x4U << RCC_PLL4CFGR1_DIVM4_Pos)              /*!< 0x00040000 */
#define RCC_PLL4CFGR1_DIVM4_3                     (0x8U << RCC_PLL4CFGR1_DIVM4_Pos)              /*!< 0x00080000 */
#define RCC_PLL4CFGR1_DIVM4_4                     (0x10U << RCC_PLL4CFGR1_DIVM4_Pos)             /*!< 0x00100000 */
#define RCC_PLL4CFGR1_DIVM4_5                     (0x20U << RCC_PLL4CFGR1_DIVM4_Pos)             /*!< 0x00200000 */
#define RCC_PLL4CFGR1_IFRGE_Pos                   (24U)
#define RCC_PLL4CFGR1_IFRGE_Msk                   (0x3U << RCC_PLL4CFGR1_IFRGE_Pos)                  /*!< 0x03000000 */
#define RCC_PLL4CFGR1_IFRGE                       RCC_PLL4CFGR1_IFRGE_Msk                            /*!< PLL4 input frequency range */
#define RCC_PLL4CFGR1_IFRGE_0                     (0x1U << RCC_PLL4CFGR1_IFRGE_Pos)            /*!< 0x01000000 */
#define RCC_PLL4CFGR1_IFRGE_1                     (0x2U << RCC_PLL4CFGR1_IFRGE_Pos)            /*!< 0x02000000 */

/****************  Bit definition for RCC_PLL4CFGR2 register  *****************/
#define RCC_PLL4CFGR2_DIVP_Pos                    (0U)
#define RCC_PLL4CFGR2_DIVP_Msk                    (0x7FU << RCC_PLL4CFGR2_DIVP_Pos)                  /*!< 0x0000007F */
#define RCC_PLL4CFGR2_DIVP                        RCC_PLL4CFGR2_DIVP_Msk                             /*!< PLL4 DIVP division factor */
#define RCC_PLL4CFGR2_DIVP_0                      (0x1U << RCC_PLL4CFGR2_DIVP_Pos)                   /*!< 0x00000001 */
#define RCC_PLL4CFGR2_DIVP_1                      (0x2U << RCC_PLL4CFGR2_DIVP_Pos)                   /*!< 0x00000002 */
#define RCC_PLL4CFGR2_DIVP_2                      (0x4U << RCC_PLL4CFGR2_DIVP_Pos)                   /*!< 0x00000004 */
#define RCC_PLL4CFGR2_DIVP_3                      (0x8U << RCC_PLL4CFGR2_DIVP_Pos)                   /*!< 0x00000008 */
#define RCC_PLL4CFGR2_DIVP_4                      (0x10U << RCC_PLL4CFGR2_DIVP_Pos)                  /*!< 0x00000010 */
#define RCC_PLL4CFGR2_DIVP_5                      (0x20U << RCC_PLL4CFGR2_DIVP_Pos)                  /*!< 0x00000020 */
#define RCC_PLL4CFGR2_DIVP_6                      (0x40U << RCC_PLL4CFGR2_DIVP_Pos)                  /*!< 0x00000040 */
#define RCC_PLL4CFGR2_DIVQ_Pos                    (8U)
#define RCC_PLL4CFGR2_DIVQ_Msk                    (0x7FU << RCC_PLL4CFGR2_DIVQ_Pos)                  /*!< 0x00007F00 */
#define RCC_PLL4CFGR2_DIVQ                        RCC_PLL4CFGR2_DIVQ_Msk                             /*!< PLL4 DIVQ division factor */
#define RCC_PLL4CFGR2_DIVQ_0                      (0x1U << RCC_PLL4CFGR2_DIVQ_Pos)                 /*!< 0x00000100 */
#define RCC_PLL4CFGR2_DIVQ_1                      (0x2U << RCC_PLL4CFGR2_DIVQ_Pos)                 /*!< 0x00000200 */
#define RCC_PLL4CFGR2_DIVQ_2                      (0x4U << RCC_PLL4CFGR2_DIVQ_Pos)                 /*!< 0x00000400 */
#define RCC_PLL4CFGR2_DIVQ_3                      (0x8U << RCC_PLL4CFGR2_DIVQ_Pos)                 /*!< 0x00000800 */
#define RCC_PLL4CFGR2_DIVQ_4                      (0x10U << RCC_PLL4CFGR2_DIVQ_Pos)                /*!< 0x00001000 */
#define RCC_PLL4CFGR2_DIVQ_5                      (0x20U << RCC_PLL4CFGR2_DIVQ_Pos)                /*!< 0x00002000 */
#define RCC_PLL4CFGR2_DIVQ_6                      (0x40U << RCC_PLL4CFGR2_DIVQ_Pos)                /*!< 0x00004000 */
#define RCC_PLL4CFGR2_DIVR_Pos                    (16U)
#define RCC_PLL4CFGR2_DIVR_Msk                    (0x7FU << RCC_PLL4CFGR2_DIVR_Pos)                  /*!< 0x007F0000 */
#define RCC_PLL4CFGR2_DIVR                        RCC_PLL4CFGR2_DIVR_Msk                             /*!< PLL4 DIVR division factor */
#define RCC_PLL4CFGR2_DIVR_0                      (0x1U << RCC_PLL4CFGR2_DIVR_Pos)               /*!< 0x00010000 */
#define RCC_PLL4CFGR2_DIVR_1                      (0x2U << RCC_PLL4CFGR2_DIVR_Pos)               /*!< 0x00020000 */
#define RCC_PLL4CFGR2_DIVR_2                      (0x4U << RCC_PLL4CFGR2_DIVR_Pos)               /*!< 0x00040000 */
#define RCC_PLL4CFGR2_DIVR_3                      (0x8U << RCC_PLL4CFGR2_DIVR_Pos)               /*!< 0x00080000 */
#define RCC_PLL4CFGR2_DIVR_4                      (0x10U << RCC_PLL4CFGR2_DIVR_Pos)              /*!< 0x00100000 */
#define RCC_PLL4CFGR2_DIVR_5                      (0x20U << RCC_PLL4CFGR2_DIVR_Pos)              /*!< 0x00200000 */
#define RCC_PLL4CFGR2_DIVR_6                      (0x40U << RCC_PLL4CFGR2_DIVR_Pos)              /*!< 0x00400000 */

