ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp151axx_ca7.h
/*************  Bit definition for RCC_MC_AHB2LPENCLRR register  **************/
#define RCC_MC_AHB2LPENCLRR_DMA1LPEN_Pos          (0U)
#define RCC_MC_AHB2LPENCLRR_DMA1LPEN_Msk          (0x1U << RCC_MC_AHB2LPENCLRR_DMA1LPEN_Pos)         /*!< 0x00000001 */
#define RCC_MC_AHB2LPENCLRR_DMA1LPEN              RCC_MC_AHB2LPENCLRR_DMA1LPEN_Msk                   /*!< DMA1 peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB2LPENCLRR_DMA2LPEN_Pos          (1U)
#define RCC_MC_AHB2LPENCLRR_DMA2LPEN_Msk          (0x1U << RCC_MC_AHB2LPENCLRR_DMA2LPEN_Pos)         /*!< 0x00000002 */
#define RCC_MC_AHB2LPENCLRR_DMA2LPEN              RCC_MC_AHB2LPENCLRR_DMA2LPEN_Msk                   /*!< DMA2 peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB2LPENCLRR_DMAMUXLPEN_Pos        (2U)
#define RCC_MC_AHB2LPENCLRR_DMAMUXLPEN_Msk        (0x1U << RCC_MC_AHB2LPENCLRR_DMAMUXLPEN_Pos)       /*!< 0x00000004 */
#define RCC_MC_AHB2LPENCLRR_DMAMUXLPEN            RCC_MC_AHB2LPENCLRR_DMAMUXLPEN_Msk                 /*!< DMAMUX peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB2LPENCLRR_ADC12LPEN_Pos         (5U)
#define RCC_MC_AHB2LPENCLRR_ADC12LPEN_Msk         (0x1U << RCC_MC_AHB2LPENCLRR_ADC12LPEN_Pos)        /*!< 0x00000020 */
#define RCC_MC_AHB2LPENCLRR_ADC12LPEN             RCC_MC_AHB2LPENCLRR_ADC12LPEN_Msk                  /*!< ADC1&amp;2 peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB2LPENCLRR_USBOLPEN_Pos          (8U)
#define RCC_MC_AHB2LPENCLRR_USBOLPEN_Msk          (0x1U << RCC_MC_AHB2LPENCLRR_USBOLPEN_Pos)         /*!< 0x00000100 */
#define RCC_MC_AHB2LPENCLRR_USBOLPEN              RCC_MC_AHB2LPENCLRR_USBOLPEN_Msk                   /*!< USBO peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB2LPENCLRR_SDMMC3LPEN_Pos        (16U)
#define RCC_MC_AHB2LPENCLRR_SDMMC3LPEN_Msk        (0x1U << RCC_MC_AHB2LPENCLRR_SDMMC3LPEN_Pos)       /*!< 0x00010000 */
#define RCC_MC_AHB2LPENCLRR_SDMMC3LPEN            RCC_MC_AHB2LPENCLRR_SDMMC3LPEN_Msk                 /*!< SDMMC3 and SDMMC3 delay (DLYBSD3) block peripheral clocks enable during CSleep mode */

/*************  Bit definition for RCC_MC_AHB3LPENSETR register  **************/
#define RCC_MC_AHB3LPENSETR_DCMILPEN_Pos          (0U)
#define RCC_MC_AHB3LPENSETR_DCMILPEN_Msk          (0x1U << RCC_MC_AHB3LPENSETR_DCMILPEN_Pos)         /*!< 0x00000001 */
#define RCC_MC_AHB3LPENSETR_DCMILPEN              RCC_MC_AHB3LPENSETR_DCMILPEN_Msk                   /*!< DCMI peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB3LPENSETR_CRYP2LPEN_Pos         (4U)
#define RCC_MC_AHB3LPENSETR_CRYP2LPEN_Msk         (0x1U << RCC_MC_AHB3LPENSETR_CRYP2LPEN_Pos)        /*!< 0x00000010 */
#define RCC_MC_AHB3LPENSETR_CRYP2LPEN             RCC_MC_AHB3LPENSETR_CRYP2LPEN_Msk                  /*!< CRYP2 (3DES/AES2) peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB3LPENSETR_HASH2LPEN_Pos         (5U)
#define RCC_MC_AHB3LPENSETR_HASH2LPEN_Msk         (0x1U << RCC_MC_AHB3LPENSETR_HASH2LPEN_Pos)        /*!< 0x00000020 */
#define RCC_MC_AHB3LPENSETR_HASH2LPEN             RCC_MC_AHB3LPENSETR_HASH2LPEN_Msk                  /*!< HASH2 peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB3LPENSETR_RNG2LPEN_Pos          (6U)
#define RCC_MC_AHB3LPENSETR_RNG2LPEN_Msk          (0x1U << RCC_MC_AHB3LPENSETR_RNG2LPEN_Pos)         /*!< 0x00000040 */
#define RCC_MC_AHB3LPENSETR_RNG2LPEN              RCC_MC_AHB3LPENSETR_RNG2LPEN_Msk                   /*!< RNG2 peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB3LPENSETR_CRC2LPEN_Pos          (7U)
#define RCC_MC_AHB3LPENSETR_CRC2LPEN_Msk          (0x1U << RCC_MC_AHB3LPENSETR_CRC2LPEN_Pos)         /*!< 0x00000080 */
#define RCC_MC_AHB3LPENSETR_CRC2LPEN              RCC_MC_AHB3LPENSETR_CRC2LPEN_Msk                   /*!< CRC2 peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB3LPENSETR_HSEMLPEN_Pos          (11U)
#define RCC_MC_AHB3LPENSETR_HSEMLPEN_Msk          (0x1U << RCC_MC_AHB3LPENSETR_HSEMLPEN_Pos)         /*!< 0x00000800 */
#define RCC_MC_AHB3LPENSETR_HSEMLPEN              RCC_MC_AHB3LPENSETR_HSEMLPEN_Msk                   /*!< HSEM peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB3LPENSETR_IPCCLPEN_Pos          (12U)
#define RCC_MC_AHB3LPENSETR_IPCCLPEN_Msk          (0x1U << RCC_MC_AHB3LPENSETR_IPCCLPEN_Pos)         /*!< 0x00001000 */
#define RCC_MC_AHB3LPENSETR_IPCCLPEN              RCC_MC_AHB3LPENSETR_IPCCLPEN_Msk                   /*!< IPCC peripheral clocks enable during CSleep mode */

/*************  Bit definition for RCC_MC_AHB3LPENCLRR register  **************/
#define RCC_MC_AHB3LPENCLRR_DCMILPEN_Pos          (0U)
#define RCC_MC_AHB3LPENCLRR_DCMILPEN_Msk          (0x1U << RCC_MC_AHB3LPENCLRR_DCMILPEN_Pos)         /*!< 0x00000001 */
#define RCC_MC_AHB3LPENCLRR_DCMILPEN              RCC_MC_AHB3LPENCLRR_DCMILPEN_Msk                   /*!< DCMI peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB3LPENCLRR_CRYP2LPEN_Pos         (4U)
#define RCC_MC_AHB3LPENCLRR_CRYP2LPEN_Msk         (0x1U << RCC_MC_AHB3LPENCLRR_CRYP2LPEN_Pos)        /*!< 0x00000010 */
#define RCC_MC_AHB3LPENCLRR_CRYP2LPEN             RCC_MC_AHB3LPENCLRR_CRYP2LPEN_Msk                  /*!< CRYP2 (3DES/AES2) peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB3LPENCLRR_HASH2LPEN_Pos         (5U)
#define RCC_MC_AHB3LPENCLRR_HASH2LPEN_Msk         (0x1U << RCC_MC_AHB3LPENCLRR_HASH2LPEN_Pos)        /*!< 0x00000020 */
#define RCC_MC_AHB3LPENCLRR_HASH2LPEN             RCC_MC_AHB3LPENCLRR_HASH2LPEN_Msk                  /*!< HASH2 peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB3LPENCLRR_RNG2LPEN_Pos          (6U)
#define RCC_MC_AHB3LPENCLRR_RNG2LPEN_Msk          (0x1U << RCC_MC_AHB3LPENCLRR_RNG2LPEN_Pos)         /*!< 0x00000040 */
#define RCC_MC_AHB3LPENCLRR_RNG2LPEN              RCC_MC_AHB3LPENCLRR_RNG2LPEN_Msk                   /*!< RNG2 peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB3LPENCLRR_CRC2LPEN_Pos          (7U)
#define RCC_MC_AHB3LPENCLRR_CRC2LPEN_Msk          (0x1U << RCC_MC_AHB3LPENCLRR_CRC2LPEN_Pos)         /*!< 0x00000080 */
#define RCC_MC_AHB3LPENCLRR_CRC2LPEN              RCC_MC_AHB3LPENCLRR_CRC2LPEN_Msk                   /*!< CRC2 peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB3LPENCLRR_HSEMLPEN_Pos          (11U)
#define RCC_MC_AHB3LPENCLRR_HSEMLPEN_Msk          (0x1U << RCC_MC_AHB3LPENCLRR_HSEMLPEN_Pos)         /*!< 0x00000800 */
#define RCC_MC_AHB3LPENCLRR_HSEMLPEN              RCC_MC_AHB3LPENCLRR_HSEMLPEN_Msk                   /*!< HSEM peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB3LPENCLRR_IPCCLPEN_Pos          (12U)
#define RCC_MC_AHB3LPENCLRR_IPCCLPEN_Msk          (0x1U << RCC_MC_AHB3LPENCLRR_IPCCLPEN_Pos)         /*!< 0x00001000 */
#define RCC_MC_AHB3LPENCLRR_IPCCLPEN              RCC_MC_AHB3LPENCLRR_IPCCLPEN_Msk                   /*!< IPCC peripheral clocks enable during CSleep mode */

/*************  Bit definition for RCC_MC_AHB4LPENSETR register  **************/
#define RCC_MC_AHB4LPENSETR_GPIOALPEN_Pos         (0U)
#define RCC_MC_AHB4LPENSETR_GPIOALPEN_Msk         (0x1U << RCC_MC_AHB4LPENSETR_GPIOALPEN_Pos)        /*!< 0x00000001 */
#define RCC_MC_AHB4LPENSETR_GPIOALPEN             RCC_MC_AHB4LPENSETR_GPIOALPEN_Msk                  /*!< GPIOA peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB4LPENSETR_GPIOBLPEN_Pos         (1U)
#define RCC_MC_AHB4LPENSETR_GPIOBLPEN_Msk         (0x1U << RCC_MC_AHB4LPENSETR_GPIOBLPEN_Pos)        /*!< 0x00000002 */
#define RCC_MC_AHB4LPENSETR_GPIOBLPEN             RCC_MC_AHB4LPENSETR_GPIOBLPEN_Msk                  /*!< GPIOB peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB4LPENSETR_GPIOCLPEN_Pos         (2U)
#define RCC_MC_AHB4LPENSETR_GPIOCLPEN_Msk         (0x1U << RCC_MC_AHB4LPENSETR_GPIOCLPEN_Pos)        /*!< 0x00000004 */
#define RCC_MC_AHB4LPENSETR_GPIOCLPEN             RCC_MC_AHB4LPENSETR_GPIOCLPEN_Msk                  /*!< GPIOC peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB4LPENSETR_GPIODLPEN_Pos         (3U)
#define RCC_MC_AHB4LPENSETR_GPIODLPEN_Msk         (0x1U << RCC_MC_AHB4LPENSETR_GPIODLPEN_Pos)        /*!< 0x00000008 */
#define RCC_MC_AHB4LPENSETR_GPIODLPEN             RCC_MC_AHB4LPENSETR_GPIODLPEN_Msk                  /*!< GPIOD peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB4LPENSETR_GPIOELPEN_Pos         (4U)
#define RCC_MC_AHB4LPENSETR_GPIOELPEN_Msk         (0x1U << RCC_MC_AHB4LPENSETR_GPIOELPEN_Pos)        /*!< 0x00000010 */
#define RCC_MC_AHB4LPENSETR_GPIOELPEN             RCC_MC_AHB4LPENSETR_GPIOELPEN_Msk                  /*!< GPIOE peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB4LPENSETR_GPIOFLPEN_Pos         (5U)
#define RCC_MC_AHB4LPENSETR_GPIOFLPEN_Msk         (0x1U << RCC_MC_AHB4LPENSETR_GPIOFLPEN_Pos)        /*!< 0x00000020 */
#define RCC_MC_AHB4LPENSETR_GPIOFLPEN             RCC_MC_AHB4LPENSETR_GPIOFLPEN_Msk                  /*!< GPIOF peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB4LPENSETR_GPIOGLPEN_Pos         (6U)
#define RCC_MC_AHB4LPENSETR_GPIOGLPEN_Msk         (0x1U << RCC_MC_AHB4LPENSETR_GPIOGLPEN_Pos)        /*!< 0x00000040 */
#define RCC_MC_AHB4LPENSETR_GPIOGLPEN             RCC_MC_AHB4LPENSETR_GPIOGLPEN_Msk                  /*!< GPIOG peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB4LPENSETR_GPIOHLPEN_Pos         (7U)
#define RCC_MC_AHB4LPENSETR_GPIOHLPEN_Msk         (0x1U << RCC_MC_AHB4LPENSETR_GPIOHLPEN_Pos)        /*!< 0x00000080 */
#define RCC_MC_AHB4LPENSETR_GPIOHLPEN             RCC_MC_AHB4LPENSETR_GPIOHLPEN_Msk                  /*!< GPIOH peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB4LPENSETR_GPIOILPEN_Pos         (8U)
#define RCC_MC_AHB4LPENSETR_GPIOILPEN_Msk         (0x1U << RCC_MC_AHB4LPENSETR_GPIOILPEN_Pos)        /*!< 0x00000100 */
#define RCC_MC_AHB4LPENSETR_GPIOILPEN             RCC_MC_AHB4LPENSETR_GPIOILPEN_Msk                  /*!< GPIOI peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB4LPENSETR_GPIOJLPEN_Pos         (9U)
#define RCC_MC_AHB4LPENSETR_GPIOJLPEN_Msk         (0x1U << RCC_MC_AHB4LPENSETR_GPIOJLPEN_Pos)        /*!< 0x00000200 */
#define RCC_MC_AHB4LPENSETR_GPIOJLPEN             RCC_MC_AHB4LPENSETR_GPIOJLPEN_Msk                  /*!< GPIOJ peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB4LPENSETR_GPIOKLPEN_Pos         (10U)
#define RCC_MC_AHB4LPENSETR_GPIOKLPEN_Msk         (0x1U << RCC_MC_AHB4LPENSETR_GPIOKLPEN_Pos)        /*!< 0x00000400 */
#define RCC_MC_AHB4LPENSETR_GPIOKLPEN             RCC_MC_AHB4LPENSETR_GPIOKLPEN_Msk                  /*!< GPIOK peripheral clocks enable during CSleep mode */

/*************  Bit definition for RCC_MC_AHB4LPENCLRR register  **************/
#define RCC_MC_AHB4LPENCLRR_GPIOALPEN_Pos         (0U)
#define RCC_MC_AHB4LPENCLRR_GPIOALPEN_Msk         (0x1U << RCC_MC_AHB4LPENCLRR_GPIOALPEN_Pos)        /*!< 0x00000001 */
#define RCC_MC_AHB4LPENCLRR_GPIOALPEN             RCC_MC_AHB4LPENCLRR_GPIOALPEN_Msk                  /*!< GPIOA peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB4LPENCLRR_GPIOBLPEN_Pos         (1U)
#define RCC_MC_AHB4LPENCLRR_GPIOBLPEN_Msk         (0x1U << RCC_MC_AHB4LPENCLRR_GPIOBLPEN_Pos)        /*!< 0x00000002 */
#define RCC_MC_AHB4LPENCLRR_GPIOBLPEN             RCC_MC_AHB4LPENCLRR_GPIOBLPEN_Msk                  /*!< GPIOB peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB4LPENCLRR_GPIOCLPEN_Pos         (2U)
#define RCC_MC_AHB4LPENCLRR_GPIOCLPEN_Msk         (0x1U << RCC_MC_AHB4LPENCLRR_GPIOCLPEN_Pos)        /*!< 0x00000004 */
#define RCC_MC_AHB4LPENCLRR_GPIOCLPEN             RCC_MC_AHB4LPENCLRR_GPIOCLPEN_Msk                  /*!< GPIOC peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB4LPENCLRR_GPIODLPEN_Pos         (3U)
#define RCC_MC_AHB4LPENCLRR_GPIODLPEN_Msk         (0x1U << RCC_MC_AHB4LPENCLRR_GPIODLPEN_Pos)        /*!< 0x00000008 */
#define RCC_MC_AHB4LPENCLRR_GPIODLPEN             RCC_MC_AHB4LPENCLRR_GPIODLPEN_Msk                  /*!< GPIOD peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB4LPENCLRR_GPIOELPEN_Pos         (4U)
#define RCC_MC_AHB4LPENCLRR_GPIOELPEN_Msk         (0x1U << RCC_MC_AHB4LPENCLRR_GPIOELPEN_Pos)        /*!< 0x00000010 */
#define RCC_MC_AHB4LPENCLRR_GPIOELPEN             RCC_MC_AHB4LPENCLRR_GPIOELPEN_Msk                  /*!< GPIOE peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB4LPENCLRR_GPIOFLPEN_Pos         (5U)
#define RCC_MC_AHB4LPENCLRR_GPIOFLPEN_Msk         (0x1U << RCC_MC_AHB4LPENCLRR_GPIOFLPEN_Pos)        /*!< 0x00000020 */
#define RCC_MC_AHB4LPENCLRR_GPIOFLPEN             RCC_MC_AHB4LPENCLRR_GPIOFLPEN_Msk                  /*!< GPIOF peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB4LPENCLRR_GPIOGLPEN_Pos         (6U)
#define RCC_MC_AHB4LPENCLRR_GPIOGLPEN_Msk         (0x1U << RCC_MC_AHB4LPENCLRR_GPIOGLPEN_Pos)        /*!< 0x00000040 */
#define RCC_MC_AHB4LPENCLRR_GPIOGLPEN             RCC_MC_AHB4LPENCLRR_GPIOGLPEN_Msk                  /*!< GPIOG peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB4LPENCLRR_GPIOHLPEN_Pos         (7U)
#define RCC_MC_AHB4LPENCLRR_GPIOHLPEN_Msk         (0x1U << RCC_MC_AHB4LPENCLRR_GPIOHLPEN_Pos)        /*!< 0x00000080 */
#define RCC_MC_AHB4LPENCLRR_GPIOHLPEN             RCC_MC_AHB4LPENCLRR_GPIOHLPEN_Msk                  /*!< GPIOH peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB4LPENCLRR_GPIOILPEN_Pos         (8U)
#define RCC_MC_AHB4LPENCLRR_GPIOILPEN_Msk         (0x1U << RCC_MC_AHB4LPENCLRR_GPIOILPEN_Pos)        /*!< 0x00000100 */
#define RCC_MC_AHB4LPENCLRR_GPIOILPEN             RCC_MC_AHB4LPENCLRR_GPIOILPEN_Msk                  /*!< GPIOI peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB4LPENCLRR_GPIOJLPEN_Pos         (9U)
#define RCC_MC_AHB4LPENCLRR_GPIOJLPEN_Msk         (0x1U << RCC_MC_AHB4LPENCLRR_GPIOJLPEN_Pos)        /*!< 0x00000200 */
#define RCC_MC_AHB4LPENCLRR_GPIOJLPEN             RCC_MC_AHB4LPENCLRR_GPIOJLPEN_Msk                  /*!< GPIOJ peripheral clocks enable during CSleep mode */
#define RCC_MC_AHB4LPENCLRR_GPIOKLPEN_Pos         (10U)
#define RCC_MC_AHB4LPENCLRR_GPIOKLPEN_Msk         (0x1U << RCC_MC_AHB4LPENCLRR_GPIOKLPEN_Pos)        /*!< 0x00000400 */
#define RCC_MC_AHB4LPENCLRR_GPIOKLPEN             RCC_MC_AHB4LPENCLRR_GPIOKLPEN_Msk                  /*!< GPIOK peripheral clocks enable during CSleep mode */

/*************  Bit definition for RCC_MC_AXIMLPENSETR register  **************/
#define RCC_MC_AXIMLPENSETR_SYSRAMLPEN_Pos        (0U)
#define RCC_MC_AXIMLPENSETR_SYSRAMLPEN_Msk        (0x1U << RCC_MC_AXIMLPENSETR_SYSRAMLPEN_Pos)       /*!< 0x00000001 */
#define RCC_MC_AXIMLPENSETR_SYSRAMLPEN            RCC_MC_AXIMLPENSETR_SYSRAMLPEN_Msk                 /*!< SYSRAM interface clock enable during CSleep mode */

/*************  Bit definition for RCC_MC_AXIMLPENCLRR register  **************/
#define RCC_MC_AXIMLPENCLRR_SYSRAMLPEN_Pos        (0U)
#define RCC_MC_AXIMLPENCLRR_SYSRAMLPEN_Msk        (0x1U << RCC_MC_AXIMLPENCLRR_SYSRAMLPEN_Pos)       /*!< 0x00000001 */
#define RCC_MC_AXIMLPENCLRR_SYSRAMLPEN            RCC_MC_AXIMLPENCLRR_SYSRAMLPEN_Msk                 /*!< SYSRAM interface clock enable during CSleep mode */

/*************  Bit definition for RCC_MC_MLAHBLPENSETR register  *************/
#define RCC_MC_MLAHBLPENSETR_SRAM1LPEN_Pos        (0U)
#define RCC_MC_MLAHBLPENSETR_SRAM1LPEN_Msk        (0x1U << RCC_MC_MLAHBLPENSETR_SRAM1LPEN_Pos)       /*!< 0x00000001 */
#define RCC_MC_MLAHBLPENSETR_SRAM1LPEN            RCC_MC_MLAHBLPENSETR_SRAM1LPEN_Msk                 /*!< SRAM1 interface clock enable during CSleep mode */
#define RCC_MC_MLAHBLPENSETR_SRAM2LPEN_Pos        (1U)
#define RCC_MC_MLAHBLPENSETR_SRAM2LPEN_Msk        (0x1U << RCC_MC_MLAHBLPENSETR_SRAM2LPEN_Pos)       /*!< 0x00000002 */
#define RCC_MC_MLAHBLPENSETR_SRAM2LPEN            RCC_MC_MLAHBLPENSETR_SRAM2LPEN_Msk                 /*!< SRAM2 interface clock enable during CSleep mode */
#define RCC_MC_MLAHBLPENSETR_SRAM34LPEN_Pos       (2U)
#define RCC_MC_MLAHBLPENSETR_SRAM34LPEN_Msk       (0x1U << RCC_MC_MLAHBLPENSETR_SRAM34LPEN_Pos)      /*!< 0x00000004 */
#define RCC_MC_MLAHBLPENSETR_SRAM34LPEN           RCC_MC_MLAHBLPENSETR_SRAM34LPEN_Msk                /*!< SRAM3 and SRAM4 interface clock enable during CSleep mode */
#define RCC_MC_MLAHBLPENSETR_RETRAMLPEN_Pos       (4U)
#define RCC_MC_MLAHBLPENSETR_RETRAMLPEN_Msk       (0x1U << RCC_MC_MLAHBLPENSETR_RETRAMLPEN_Pos)      /*!< 0x00000010 */
#define RCC_MC_MLAHBLPENSETR_RETRAMLPEN           RCC_MC_MLAHBLPENSETR_RETRAMLPEN_Msk                /*!< RETRAM interface clock enable during CSleep mode */

/*************  Bit definition for RCC_MC_MLAHBLPENCLRR register  *************/
#define RCC_MC_MLAHBLPENCLRR_SRAM1LPEN_Pos        (0U)
#define RCC_MC_MLAHBLPENCLRR_SRAM1LPEN_Msk        (0x1U << RCC_MC_MLAHBLPENCLRR_SRAM1LPEN_Pos)       /*!< 0x00000001 */
#define RCC_MC_MLAHBLPENCLRR_SRAM1LPEN            RCC_MC_MLAHBLPENCLRR_SRAM1LPEN_Msk                 /*!< SRAM1 interface clock enable during CSleep mode */
#define RCC_MC_MLAHBLPENCLRR_SRAM2LPEN_Pos        (1U)
#define RCC_MC_MLAHBLPENCLRR_SRAM2LPEN_Msk        (0x1U << RCC_MC_MLAHBLPENCLRR_SRAM2LPEN_Pos)       /*!< 0x00000002 */
#define RCC_MC_MLAHBLPENCLRR_SRAM2LPEN            RCC_MC_MLAHBLPENCLRR_SRAM2LPEN_Msk                 /*!< SRAM2 interface clock enable during CSleep mode */
#define RCC_MC_MLAHBLPENCLRR_SRAM34LPEN_Pos       (2U)
#define RCC_MC_MLAHBLPENCLRR_SRAM34LPEN_Msk       (0x1U << RCC_MC_MLAHBLPENCLRR_SRAM34LPEN_Pos)      /*!< 0x00000004 */
#define RCC_MC_MLAHBLPENCLRR_SRAM34LPEN           RCC_MC_MLAHBLPENCLRR_SRAM34LPEN_Msk                /*!< SRAM3 and SRAM4 interface clock enable during CSleep mode */
#define RCC_MC_MLAHBLPENCLRR_RETRAMLPEN_Pos       (4U)
#define RCC_MC_MLAHBLPENCLRR_RETRAMLPEN_Msk       (0x1U << RCC_MC_MLAHBLPENCLRR_RETRAMLPEN_Pos)      /*!< 0x00000010 */
#define RCC_MC_MLAHBLPENCLRR_RETRAMLPEN           RCC_MC_MLAHBLPENCLRR_RETRAMLPEN_Msk                /*!< RETRAM interface clock enable during CSleep mode */

/***************  Bit definition for RCC_MC_RSTSCLRR register  ****************/
#define RCC_MC_RSTSCLRR_PORRSTF_Pos               (0U)
#define RCC_MC_RSTSCLRR_PORRSTF_Msk               (0x1U << RCC_MC_RSTSCLRR_PORRSTF_Pos)              /*!< 0x00000001 */
#define RCC_MC_RSTSCLRR_PORRSTF                   RCC_MC_RSTSCLRR_PORRSTF_Msk                        /*!< POR/PDR reset flag */
#define RCC_MC_RSTSCLRR_BORRSTF_Pos               (1U)
#define RCC_MC_RSTSCLRR_BORRSTF_Msk               (0x1U << RCC_MC_RSTSCLRR_BORRSTF_Pos)              /*!< 0x00000002 */
#define RCC_MC_RSTSCLRR_BORRSTF                   RCC_MC_RSTSCLRR_BORRSTF_Msk                        /*!< BOR reset flag */
#define RCC_MC_RSTSCLRR_PADRSTF_Pos               (2U)
#define RCC_MC_RSTSCLRR_PADRSTF_Msk               (0x1U << RCC_MC_RSTSCLRR_PADRSTF_Pos)              /*!< 0x00000004 */
#define RCC_MC_RSTSCLRR_PADRSTF                   RCC_MC_RSTSCLRR_PADRSTF_Msk                        /*!< NRST reset flag */
#define RCC_MC_RSTSCLRR_HCSSRSTF_Pos              (3U)
#define RCC_MC_RSTSCLRR_HCSSRSTF_Msk              (0x1U << RCC_MC_RSTSCLRR_HCSSRSTF_Pos)             /*!< 0x00000008 */
#define RCC_MC_RSTSCLRR_HCSSRSTF                  RCC_MC_RSTSCLRR_HCSSRSTF_Msk                       /*!< HSE CSS reset flag */
#define RCC_MC_RSTSCLRR_VCORERSTF_Pos             (4U)
#define RCC_MC_RSTSCLRR_VCORERSTF_Msk             (0x1U << RCC_MC_RSTSCLRR_VCORERSTF_Pos)            /*!< 0x00000010 */
#define RCC_MC_RSTSCLRR_VCORERSTF                 RCC_MC_RSTSCLRR_VCORERSTF_Msk                      /*!< VDDCORE reset flag */
#define RCC_MC_RSTSCLRR_MCURSTF_Pos               (5U)
#define RCC_MC_RSTSCLRR_MCURSTF_Msk               (0x1U << RCC_MC_RSTSCLRR_MCURSTF_Pos)              /*!< 0x00000020 */
#define RCC_MC_RSTSCLRR_MCURSTF                   RCC_MC_RSTSCLRR_MCURSTF_Msk                        /*!< MCU reset flag */
#define RCC_MC_RSTSCLRR_MPSYSRSTF_Pos             (6U)
#define RCC_MC_RSTSCLRR_MPSYSRSTF_Msk             (0x1U << RCC_MC_RSTSCLRR_MPSYSRSTF_Pos)            /*!< 0x00000040 */
#define RCC_MC_RSTSCLRR_MPSYSRSTF                 RCC_MC_RSTSCLRR_MPSYSRSTF_Msk                      /*!< MPU System reset flag */
#define RCC_MC_RSTSCLRR_MCSYSRSTF_Pos             (7U)
#define RCC_MC_RSTSCLRR_MCSYSRSTF_Msk             (0x1U << RCC_MC_RSTSCLRR_MCSYSRSTF_Pos)            /*!< 0x00000080 */
#define RCC_MC_RSTSCLRR_MCSYSRSTF                 RCC_MC_RSTSCLRR_MCSYSRSTF_Msk                      /*!< MCU System reset flag */
#define RCC_MC_RSTSCLRR_IWDG1RSTF_Pos             (8U)
#define RCC_MC_RSTSCLRR_IWDG1RSTF_Msk             (0x1U << RCC_MC_RSTSCLRR_IWDG1RSTF_Pos)            /*!< 0x00000100 */
#define RCC_MC_RSTSCLRR_IWDG1RSTF                 RCC_MC_RSTSCLRR_IWDG1RSTF_Msk                      /*!< IWDG1 reset flag */
#define RCC_MC_RSTSCLRR_IWDG2RSTF_Pos             (9U)
#define RCC_MC_RSTSCLRR_IWDG2RSTF_Msk             (0x1U << RCC_MC_RSTSCLRR_IWDG2RSTF_Pos)            /*!< 0x00000200 */
#define RCC_MC_RSTSCLRR_IWDG2RSTF                 RCC_MC_RSTSCLRR_IWDG2RSTF_Msk                      /*!< IWDG2 reset flag */
#define RCC_MC_RSTSCLRR_WWDG1RSTF_Pos             (10U)
#define RCC_MC_RSTSCLRR_WWDG1RSTF_Msk             (0x1U << RCC_MC_RSTSCLRR_WWDG1RSTF_Pos)            /*!< 0x00000400 */
#define RCC_MC_RSTSCLRR_WWDG1RSTF                 RCC_MC_RSTSCLRR_WWDG1RSTF_Msk                      /*!< WWDG1 reset flag */

